<?php

// 1. Доработайте скрипт инициализации базы данных fixture.php, добавив в него выполнение 
// запроса на создание таблицы tasks, содержащей поля: id (int), 
// description (varchar), isDone (tinyint);

// 2. Воспользовавшись наработками по TaskProvider **из практического задания прошлого 
// урока выполните доработку функционала. Адаптируйте механику метода **addTask для 
// сохранения задач в БД. Также, обновите код метода getUndoneList, для получения 
// невыполненных задач из базы данных;

// 3. Разработайте форму регистрации пользователей. Создайте новый файл представления (view) 
// на основании существующего signin.php. Добавьте в форму поля ввода имени, username 
// и пароля. По нажатию кнопки “Зарегистрироваться” создайте запись в БД и сразу же 
// авторизуйте нового пользователя. Страница регистрации должна быть доступна только 
// для неавторизованных пользователей.

session_start();

$controller = $_GET['controller'] ?? 'home';
$routes = require 'routes.php';

if(isset($routes[$controller])) require_once $routes[$controller];
else require_once $routes['404'];