<?php 

// 1.Подготовьте два массива одинаковой размерности, но не менее 10 элементов, с произвольными числовыми значениями. 
// Разработайте скрипт для запуска из командной строки, выполняющий перемножение элементов двух массивов и выводящий 
// результат в консоль с помощью print_r. Умножение должно выполняться только между элементами соответствующих 
// индексов, то есть нулевой элемент первого массива умножается на нулевой элемент второго массива;


$number1 = [1,2,3,4,5,6,7,8,9,10];
$number2 = [2,4,6,8,10,12,14,16,18,20];
// $result = [];

foreach ($number1 as $index => $number) {
    $result[] = $number * $number2[$index];
}
print_r($result);

?>