<?php
// 3.Подготовьте многомерный ассоциативный массив следующего вида:
// $students = [
//    'ИТ20' => [
//        'Иванов Иван' => 5,
//        'Кириллов Кирилл' => 3
//    ],
//    'БАП20' => [
//        'Антонов Антон' => 4
//    ]
// ];
// В качестве ключей массива используются названия групп. В качестве элементов — отношение студента и его оценки. 
// Добавьте произвольные имена студентов и их оценки в обе группы. После подготовки массива, реализуйте скрипт 
// командной строки, выполняющий следующие вычисления:
// Вычислить арифметическое среднее по всем оценкам в рамках группы. Вывести на экран название группы с самым 
// большим вычисленным значением успеваемости;
// Составить список на отчисление, в который попадают студенты из любой группы, имеющие оценку ниже трёх. 
// В списке студенты должны быть сгруппированы по их группе. Выведите полученные данные в консоль, 
// с помощью функции print_r; 

$students = [
    'ИТ20' => [ 
    'Смирнова Христина Потаповна' => 5,
    'Рогозин Даниил Арсениевич' => 2,
    'Золин Владилен Леонтиевич' => 4,
    'Архаткина Владислава Никитевна' => 4,
    'Мещерякова Мария Елизаровна' => 3,
    'Саврасова Фаина Ивановна' => 2,
    'Хромченко Зинаида Николаевна' => 5,
    'Протасова Майя Леонидовна' => 2
    ],
    'БАП20' => [
    'Ябров Тимур Чеславович' => 4,
    'Белорусов Ефрем Изяславович' => 5,
    'Ягода Назар Прохорович' => 3,
    'Ярилова Розалия Серафимовна' => 2,
    'Нырко Платон Вадимович' => 2,
    'Калинин Агап Моисеевич' => 5,
    'Никифоров Юлиан Прокофиевич' => 3
    ]
    ];

    $middle1 = array_sum($students['ИТ20'])/count($students['ИТ20']);
    $middle2 = array_sum($students['БАП20'])/count($students['БАП20']);
    echo ($middle1 > $middle2) ? "Выше средний бал - $middle1 у группы ИТ20" : "Выше средний бал - $middle2 у группы БАП20\n";

    foreach($students as $key => $group) {
        foreach ($group as $name => $mark) {
            if ($mark < 3) {
                $badMarkStudents[$key][] = $name;
            }
        }
    }
    print_r($badMarkStudents);