<?php

//      1.Доработайте механизм авторизации. Разместите на главной странице кнопку “Войти”, 
// отображаемую только если пользователь не авторизован. Перенесите логику “Выхода” 
// в SecurityController. Сделайте отображение ссылки “Выйти” только для тех случаев, 
// если пользователь авторизован в системе;

//      2.Разработайте страницу работы с задачами TODO-списка, доступную только авторизованным 
// пользователям. Подготовьте отдельный файл представления (view), контроллер (TaskController) 
// и два класса модели: TaskProvider и сущность Task. В сущности Task реализуйте свойства 
// isDone (bool) и description (string). В TaskProvider разработайте два метода: 
// getUndoneList – для получения списка невыполненных задач и addTask для добавления. 
// Сохраняйте задачи в сессию авторизованного пользователя. В файле представления выведите 
// список текущих задач с кнопкой выполнения (используйте тег <a> с передачей GET-параметров), 
// а также подготовьте форму для их добавления.

session_start();

$controller = $_GET['controller'] ?? 'home';
$routes = require 'routes.php';

if(isset($routes[$controller])) require_once $routes[$controller];
else require_once $routes['404'];