<?php 
/*
1) Воспользуйтесь материалами урока и установите интерпретатор PHP версии 7.4 на ваш компьютер.
2) Реализуйте скрипт для запуска из командной строки. При запуске скрипт должен 
спросить у пользователя его имя, а после получения ответа задать вопрос о возрасте. 
После получения всех необходимых данных необходимо вывести строчный результат вида 
«Вас зовут ИМЯ, вам ВОЗРАСТ лет».
3) Доработайте скрипт, реализованный во втором задании, следующим образом: Замените 
вопрос о возрасте на цепочку опроса о важных делах, запланированных на день (три задачи). 
Программа спрашивает: «Какая задача стоит перед вами сегодня?». Пользователь отвечает 
текстом и нажимает Enter. Следующий вопрос программы: «Сколько примерно времени эта 
задача займет?». Пользователь отвечает числом и нажимает Enter. Обратите внимание,
 что количество задач строго ограничено в коде и равно трём. Вероятность ввода 
 некорректных значений в данном задании игнорируем. После трёх вопросов выводится 
 итог следующего вида:
Иван, сегодня у вас запланировано 3 приоритетных задачи на день:
- Погулять с кошкой (1ч)
- Попить кофе (2ч)
- Полежать на диване (4ч)
Примерное время выполнения плана = 7ч
*/
$qu1 = readline("Какая задача стоит перед вами сегодня? ");
$qu12 = (int)readline("Сколько примерно времени эта задача займет? ");
$qu2 = readline("Какая ещё задача стоит перед вами сегодня? ");
$qu22 = (int)readline("Сколько примерно времени эта задача займет? ");
$qu3 = readline("Какая ещё задача стоит перед вами сегодня? ");
$qu32 = (int)readline("Сколько примерно времени эта задача займет? ");

$total = $qu12+$qu22+$qu32;

echo "Иван, сегодня у вас запланировано 3 приоритетных задачи на день:\n
- $qu1 ($qu12)\n
- $qu2 ($qu22)\n
- $qu3 ($qu32)\n
- Примерное время выполнения плана = $total";

?>