<?php
// 1. Разработайте скрипт командной строки, задающий любой исторический вопрос с предоставлением трёх вариантов ответов. 
// Например: «В каком году произошло крещение Руси?». Варианты: 810, 990 или 740 год. В случае, если пользователь ответит 
// вариантом, не входящим в перечень ответов, повторите вопрос. Если пользователь ответил ожидаемым вариантом, но не верно, 
// выведите сообщение о неверном ответе и завершите программу. Если пользователь ответил правильно, поздравьте его 
// и завершите выполнение скрипта.

$usa = [1776, 1667, 1525];
    do {
        $humanReply = readline("Выберите правильный вариант. Год образования США - 1776, 1667, 1525: " . PHP_EOL);
        if ($humanReply == $usa[0]) {
            echo "Поздравляю с правильным ответом!"; break; 
        }
        if ($humanReply == $usa[1] OR $humanReply == $usa[2]) {
            echo "Неверный ответ, до свидания."; break; 
        }
    }
    while (true);
// 2.

?>