<?php
// 2. Доработайте задание с прошлого занятия с использованием условных операторов и циклических конструкций. 
// Реализуйте скрипт, запрашивающий у пользователя количество задач, запланированных на день. После получения 
// корректного числа, программа должна спросить определённое количество раз, какая задача запланирована и сколько 
// примерно времени займёт её выполнение. По завершению циклического опроса необходимо вывести итог запланированного 
// пользователем дня, содержащий весь перечень задач с оценкой времени, а также суммарное количество часов.

$quantity = (int)readline("Сколько задач запланировано на день? " . PHP_EOL);
for ($i=0; $i < $quantity; $i++) {
    $task[$i] = readline("Какая задача стоит перед вами сегодня? ");
    $time[$i] = (int)readline("Сколько примерно времени эта задача займет? ");
}
for ($i=0; $i < count($task); $i++) {
    echo "$task[$i] займёт $time[$i] часов" . PHP_EOL;
}
$totalTime = array_sum($time);
echo "всего вы потратите $totalTime часов";



?>